public class mamo {
    public static void main(String[] args) {
        /*

하나의 자바 프로젝트(프로그램) = 클래스와 리스소(이미지파일, 동영상 파일, 소리파일)
들의 집합

객체지향 프로그래밍
: 클래스를 정의하고, 정의한 클래스로 부터 객체를 생성하며, 생성된 객체들간의 상호작용을 통해 문제를 해결하는것

클래스 vs 객체
: 클래스는 객체의 공통적인 특징과 기능을 정의한것
: 객체는 클래스로 부터 실체화한 것
클래스 = 멤버필드들과 멤버 메소들의 집합

메소드 = 연관된 문장들의 집합 (다른언어에서는 함수)
문장 = 예약어와 식 그리고;로 구성
식 = 식별자, 리터럴, 연산자로 구성(토큰, 어휘들로 구성) ex 조건식 if (input == "1")

어휘 = 예약어, 연산자, 구분자, 주석, 식별자(변수, 메소드 이름, 클래스 이름),
리터럴(소스코드에 상태를 보면 값을 예측 할수 있는거 ex 숫자 0,1)

//예약어는 ;이 없음

// 변수 데이터를 담는 공간
// 상수 것모습은 변수인데 값은 안변함
//멤버 필드와 멤버 메소드를 구분할수 있어야 클레스를 만들수있음


         */
    }
}
